{
    "https://dashboard.thehousekraft.com/dashboard": {
        "summary": "The primary purpose of the House Kraft Dashboard page is to provide an overview and management interface for tracking and overseeing various projects, leads, orders, and approvals within the organization. It consolidates key financial metrics, project statuses, and allows for the generation of promo codes and project overviews, facilitating efficient project management and decision-making.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code Dashboard Welcome, ACP Total Cost ₹3,85,71,362 Total Pre Design Cost ₹6,23,350 Total Orders Cost ₹31,79,158 Total Orders Pre Design Cost ₹6,23,350 Projects Project ID Project Name Lead Name Phone Number Status Assigned To Last Updated Handover Date 331 Gotham City A ACP 1231231231 Pre Design S Shyanti Sep 8, 2025 Mar 26, 2026 View 333 Engrace 3 M Mano 9884373499 Pre Design S Shyanti Sep 9, 2025 Mar 26, 2026 View 334 Sentient A ACP 1231231231 Pre Design S Shyanti Sep 6, 2025 Jan 20, 2026 View 335 Sentient A ACP 1231231231 Pre Design S Shyanti Sep 9, 2025 Mar 28, 2026 View 337 test3d A ACP 1231231231 Requirement Gathering S Shyanti Sep 9, 2025 Feb 4, 2026 View 1 2 3 4 5 5 5 Pending Approvals Expected End Date Requested End Date Type Project Name Requested Custmer Oct 23, 2025 Sep 19, 2025 DOCUMENT testmultipleimgs A ACP View Approve Oct 4, 2025 Sep 19, 2025 DOCUMENT testmultipleimgs A ACP View Approve Sep 26, 2025 Sep 19, 2025 DOCUMENT testmultipleimgs A ACP View Approve Oct 1, 2025 Sep 19, 2025 DOCUMENT testmultipleimgs A ACP View Approve Sep 24, 2025 Sep 19, 2025 DOCUMENT testmultipleimgs A ACP View Approve 1 2 5 5 Promo Code Generator Promo Code Generator Search Lead by Name Generate Project Overview Just Started 50 Projects Ongoing Project 3 Projects About to Complete 0 Projects Status Summary Requirement Gathering Pre Design Token Design Production Execution Pre Installation Installation Site Inspection Handover 23 Projects 19 Projects 8 Projects 2 Projects 0 Projects 0 Projects 1 Projects 0 Projects 0 Projects 0 Projects",
        "outgoing_links": [
            "https://dashboard.thehousekraft.com/projects/334/project-details",
            "https://dashboard.thehousekraft.com/projects/all-projects?status[]=REQUIREMENT_GATHERING&status[]=PRE_DESIGN&status[]=TOKEN",
            "https://dashboard.thehousekraft.com/projects/337/project-details",
            "https://dashboard.thehousekraft.com/leads",
            "https://dashboard.thehousekraft.com/builder-costing",
            "https://dashboard.thehousekraft.com/projects/333/project-details",
            "https://dashboard.thehousekraft.com/products",
            "https://dashboard.thehousekraft.com/projects/331/project-details",
            "https://dashboard.thehousekraft.com/projects",
            "https://dashboard.thehousekraft.com/approval",
            "https://dashboard.thehousekraft.com/all-tickets",
            "https://dashboard.thehousekraft.com/projects/335/project-details",
            "https://dashboard.thehousekraft.com/orders/all-orders?status[]=PRE_INSTALLATION&status[]=EXECUTION&status[]=PRODUCTION&status[]=DESIGN",
            "https://dashboard.thehousekraft.com/promo-code",
            "https://dashboard.thehousekraft.com/inspirations",
            "https://dashboard.thehousekraft.com/commercials",
            "https://dashboard.thehousekraft.com/orders",
            "https://dashboard.thehousekraft.com/orders/all-orders?status[]=INSTALLATION&status[]=SITE_INSPECTION&status[]=HANDOVER"
        ]
    },
    "https://dashboard.thehousekraft.com/leads": {
        "summary": "The primary purpose of the page is to display and manage leads for the House Kraft business, allowing users to view, track, and organize potential customer information and contact details.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code Leads All Leads Create Lead Status empty Sub Status empty Lead Name Apply Lead ID Lead Name Contact Email Updated On 49 Shubham 7004341583 shubham.modernspaaces1@gmail.com 23 Sep 2025, 02:41 PM 48 Praveen Damodaran 9900073553 ndpraveen@gmail.com 22 Sep 2025, 01:50 PM 47 kaffil sayed 8446618673 kjaffilsayed@gmail.com 22 Sep 2025, 01:04 PM 46 Jayad Aadrit 7411482876 jayadaadrit@gmail.com 20 Sep 2025, 04:01 PM 45 Nandish B S 9066576009 nandishanimations27@gmail.com 19 Sep 2025, 04:07 PM 44 Kshithija 9108677101 kshithija@thehousekraft.com 16 Sep 2025, 01:57 PM 43 Prity 7004064768 prity123@gmail.com 16 Sep 2025, 12:30 PM 42 Saurabh Karkera 7760753643 saurabhk@gmail.com 15 Sep 2025, 04:20 PM 41 Anirudh 8951657523 anirudh@thehousekraft.com 15 Sep 2025, 03:57 PM 40 Pradyumna D 7892981741 pradyumna.dronumraju@gmail.com 14 Sep 2025, 12:12 PM 1 to 10 of 23 10 10",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/projects": {
        "summary": "The main purpose of the page at 'https://dashboard.thehousekraft.com/projects' is to serve as a dashboard for managing and overseeing various projects related to House Kraft.",
        "raw_text": "House Kraft",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/orders": {
        "summary": "The main purpose of the page 'https://dashboard.thehousekraft.com/orders' is to provide users with a dashboard for managing and viewing their orders related to House Kraft.",
        "raw_text": "House Kraft",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/products": {
        "summary": "The main purpose of the page is to serve as a dashboard for managing and displaying products related to House Kraft.",
        "raw_text": "House Kraft",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/inspirations": {
        "summary": "The main purpose of the page 'https://dashboard.thehousekraft.com/inspirations' is to provide users with inspiration and ideas related to home design and decoration.",
        "raw_text": "House Kraft",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/commercials": {
        "summary": "The primary purpose of the page is to serve as a dashboard for managing and displaying commercial properties or listings associated with House Kraft.",
        "raw_text": "House Kraft",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/approval": {
        "summary": "The main purpose of the page is to manage and track the approval status of various projects and activities within the House Kraft system, allowing users to view details such as lead names, project IDs, expected end dates, and reasons for approval delays.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code Approval Approvals Delays Documents Lead Name Project Name Project Id Activity Name Sub Activity Name Expected End Date Requested End Date Approval Status Reason Actions ACP testmultipleimgs 356 Design Stage Sales to Design KT 16/09/25 19/09/25 Approved sales team was on leave 1 to 1 of 1 10 10",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/all-tickets": {
        "summary": "The main purpose of the page is to display and manage all tickets related to the House Kraft dashboard, allowing users to view ticket statuses, lead information, and perform actions on those tickets.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code Tickets All Tickets Status empty Lead Name Apply Lead Name Contact Email Status Updated On Subject Actions No available options 0 to 0 of 0 10 10",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/builder-costing": {
        "summary": "The primary purpose of the 'Builder Costing' page is to provide detailed cost estimates and pricing information for various construction and interior design elements, such as false ceilings, lighting, and other materials, to assist builders and contractors in budgeting and project planning.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code Builder Costing Builder Costing False Ceiling Builder Kitchen Builder CounterTop Builder Builder Costing Type Description Unit Cost (Rs.) False Ceiling Rate Rs. per sqft 50 Cove Labour Rs. per running ft 75 Strip Length mm 5000 Strip Price Rs. per 5000mm 475 Choke Price Rs. per 5000mm 375 Led Strip Labour Rs. per 304.8mm 30 Light Point Creation Rs. per light 1000 Profile Casing Length mm 2700 Profile Casing Price Rs. per length 200 Cove Point Creation Rs. per point 750 Margin percentage 20 FC Lumen Costing Area Low (Rs. per Lumen) Medium (Rs. per Lumen) High (Rs. per Lumen) Living Room 25 30 45 Dining Room 14 18 27 Kitchen 35 40 50 Bedroom 15 20 28 Study Room 25 35 45 Bathroom 25 35 52.5 Balcony 8 12 18 Utility 25 35 52.5 Pre-Foyer 10 12 18 Foyer 14 18 24",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/promo-code": {
        "summary": "The main purpose of the page is to provide a tool for generating and managing promo codes, including tracking their status and details such as expiration and claims.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code Promo Code Promo Code Promo Code Generator Search Lead by Name Generate Promo Code Lead ID Lead Name User ID Generated By Valid Till Claimed FQQVBJ 24 ACP 1 ACP Expired Yes KCSNLX 30 Mano 1 ACP Expired No YUVPEM 24 ACP 1 ACP Expired Yes BQXYOT 24 ACP 1 ACP Expired Yes 1",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/projects/331/project-details": {
        "summary": "The main purpose of the page is to provide detailed information and management tools for a specific construction project, including project data, assignee management, scheduling, and inspiration resources.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code Project Details Project Data Project Name : Gotham City Lead Name : ACP Assignee : Shyanti Budget : 1300000 Builder/Developer Wing/Building Name Floor Unit Facing Unit Number * Designer * Scope * Turnkey Semi-Furnish Turnkey Semi-Furnish Status Pre Design Pre Design Description Project Assignees Current Assignees: ACP Thrinesh Kshithija Anirudh Shyanti Devendra Satheesh Mujamil Vinod kumar Add New Assignees Search and select new assignees to add... View Floor Plan Update PROJECT SCHEDULER View Scheduled Activity QUOTATIONS Generate detailed BoQ quickly INSPIRATIONS View Inspirations by client",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/projects/333/project-details": {
        "summary": "The main purpose of the page is to provide detailed information and management tools for a specific construction project, including project details, assignees, budget, status, and options to view floor plans and generate quotations.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code Project Details Project Data Project Name : Engrace 3 Lead Name : Mano Assignee : Shyanti Budget : 800000 Builder/Developer Wing/Building Name Floor Unit Facing Unit Number * Designer * Scope * Turnkey Semi-Furnish Turnkey Semi-Furnish Status Pre Design Pre Design Description Project Assignees Current Assignees: ACP Thrinesh Kshithija Anirudh Shyanti Devendra Satheesh Mujamil Vinod kumar Add New Assignees Search and select new assignees to add... View Floor Plan Update PROJECT SCHEDULER View Scheduled Activity QUOTATIONS Generate detailed BoQ quickly INSPIRATIONS View Inspirations by client",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/projects/334/project-details": {
        "summary": "The main purpose of the page is to provide detailed information and management tools for a specific project within the House Kraft Dashboard, allowing users to view project details, manage assignees, schedule activities, and generate quotations.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code Project Details Project Data Project Name : Sentient Lead Name : ACP Assignee : Shyanti Budget : 800000 Builder/Developer Wing/Building Name Floor Unit Facing Unit Number * Designer * Scope * Status Pre Design Pre Design Description Project Assignees Current Assignees: ACP Thrinesh Kshithija Anirudh Shyanti Devendra Satheesh Mujamil Vinod kumar Add New Assignees Search and select new assignees to add... View Floor Plan Update PROJECT SCHEDULER View Scheduled Activity QUOTATIONS Generate detailed BoQ quickly INSPIRATIONS View Inspirations by client",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/projects/335/project-details": {
        "summary": "The primary purpose of the page is to provide detailed information and management tools for a specific construction project, including project details, assignees, scheduling, and related resources.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code Project Details Project Data Project Name : Sentient Lead Name : ACP Assignee : Shyanti Budget : 2000000 Builder/Developer Wing/Building Name Floor Unit Facing Unit Number * Designer * Scope * Status Pre Design Pre Design Description Project Assignees Current Assignees: ACP Thrinesh Kshithija Anirudh Shyanti Devendra Satheesh Mujamil Vinod kumar Add New Assignees Search and select new assignees to add... View Floor Plan Update PROJECT SCHEDULER View Scheduled Activity QUOTATIONS Generate detailed BoQ quickly INSPIRATIONS View Inspirations by client",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/projects/337/project-details": {
        "summary": "The main purpose of the page is to provide detailed information and management tools for a specific project within the House Kraft Dashboard, allowing users to view and update project details, assign team members, and manage project scheduling and inspirations.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code Project Details Project Data Project Name : test3d Lead Name : ACP Assignee : Shyanti Budget : 500000 Builder/Developer Wing/Building Name Floor Unit Facing Unit Number * Designer * Scope * Status Requirement Gathering Requirement Gathering Description Project Assignees Current Assignees: ACP Thrinesh Kshithija Anirudh Shyanti Devendra Satheesh Mujamil Vinod kumar Add New Assignees Search and select new assignees to add... View Floor Plan Update PROJECT SCHEDULER View Scheduled Activity INSPIRATIONS View Inspirations by client",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/projects/all-projects?status[]=REQUIREMENT_GATHERING&status[]=PRE_DESIGN&status[]=TOKEN": {
        "summary": "The primary purpose of the page is to provide a dashboard for managing and tracking the status of various projects, specifically those in the stages of Requirement Gathering, Pre Design, and Token. It allows users to view project details, collaborate with team members, and monitor project progress.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code All Projects Projects List Create Project Status Requirement Gathering, Pre Design, Token Collaborate Assignee Apply Project ID Lead Name Project Name Assigned To Collaborators Status Phone Number AddedOn Date Last Updated 387 Shubham test Shyanti Requirement Gathering 7004341583 23 Sep 2025, 02:42 PM 23 Sep 2025, 02:44 PM 376 ACP Sentient Shyanti Token 1231231231 22 Sep 2025, 01:26 PM 23 Sep 2025, 12:02 PM 383 kaffil sayed test 2 Shyanti Pre Design 8446618673 22 Sep 2025, 04:38 PM 22 Sep 2025, 05:29 PM 367 ACP new Shyanti Token 1231231231 17 Sep 2025, 11:04 PM 22 Sep 2025, 04:19 PM 382 kaffil sayed test 2 Shyanti Requirement Gathering 8446618673 22 Sep 2025, 04:05 PM 22 Sep 2025, 04:06 PM 381 kaffil sayed test Shyanti Requirement Gathering 8446618673 22 Sep 2025, 03:58 PM 22 Sep 2025, 04:00 PM 380 kaffil sayed engrace Shyanti Requirement Gathering 8446618673 22 Sep 2025, 03:35 PM 22 Sep 2025, 03:37 PM 379 Praveen Damodaran Soulace Shyanti Requirement Gathering 9900073553 22 Sep 2025, 01:53 PM 22 Sep 2025, 01:55 PM 378 Pradyumna D Timeline test Shyanti Requirement Gathering 7892981741 22 Sep 2025, 01:34 PM 22 Sep 2025, 01:36 PM 377 kaffil sayed engrace Shyanti Requirement Gathering 8446618673 22 Sep 2025, 01:28 PM 22 Sep 2025, 01:28 PM 1 to 10 of 50 10 10",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/orders/all-orders?status[]=PRE_INSTALLATION&status[]=EXECUTION&status[]=PRODUCTION&status[]=DESIGN": {
        "summary": "The primary purpose of the page is to display and manage a list of orders categorized by their status (Pre Installation, Execution, Production, Design) within the House Kraft dashboard, allowing users to collaborate and track the progress of various projects.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code All Orders Orders List Status Pre Installation, Execution, Production, Design Collaborate Assignee Apply Order ID Lead Name Project Name Assigned To Collaborators Status Phone Number AddedOn Date Last Updated 386 ACP Gotham City Shyanti Design 1231231231 23 Sep 2025, 02:19 PM 23 Sep 2025, 02:37 PM 385 Nandish B S Testing Emails 1 Shyanti Design 9066576009 23 Sep 2025, 11:24 AM 23 Sep 2025, 01:10 PM 356 ACP testmultipleimgs Shyanti Pre Installation 1231231231 10 Sep 2025, 05:19 PM 19 Sep 2025, 03:36 PM 1 to 3 of 3 10 10",
        "outgoing_links": []
    },
    "https://dashboard.thehousekraft.com/orders/all-orders?status[]=INSTALLATION&status[]=SITE_INSPECTION&status[]=HANDOVER": {
        "summary": "The main purpose of the page is to provide a dashboard for managing and tracking the status of various orders related to installation, site inspection, and handover within the House Kraft system.",
        "raw_text": "House Kraft Dashboard Leads Projects Orders Products Inspirations Commercials Approvals Tickets Builder Costing Promo Code All Orders Orders List Status Installation, Site Inspection, Handover Collaborate Assignee Apply Order ID Lead Name Project Name Assigned To Collaborators Status Phone Number AddedOn Date Last Updated 386 ACP Gotham City Shyanti Design 1231231231 23 Sep 2025, 02:19 PM 23 Sep 2025, 02:37 PM 385 Nandish B S Testing Emails 1 Shyanti Design 9066576009 23 Sep 2025, 11:24 AM 23 Sep 2025, 01:10 PM 356 ACP testmultipleimgs Shyanti Pre Installation 1231231231 10 Sep 2025, 05:19 PM 19 Sep 2025, 03:36 PM 1 to 3 of 3 10 10",
        "outgoing_links": []
    }
}